In [1]:

import pandas as pd
from azureml.data.dataset_factory import TabularDatasetFactory


url = 'https://cap.blob.core.windows.net/cap/train.csv'

ds = TabularDatasetFactory.from_delimited_files(url)

In [2]:
from sklearn.linear_model import LogisticRegression
import argparse
import os
import numpy as np
from sklearn.metrics import mean_squared_error
import joblib
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import OneHotEncoder
import pandas as pd
from azureml.core.run import Run
from azureml.data.dataset_factory import TabularDatasetFactory

In [19]:
run = Run.get_context()


def clean_data(data):

    x_df = ds.to_pandas_dataframe().dropna()
    x_df['Loan_Status'].replace(True, 1, inplace=True)
    x_df['Loan_Status'].replace(False, 0, inplace=True)
    x_df.Gender = x_df.Gender.map({'Male': 1, 'Female': 0})
    x_df.Married=x_df.Married.map({True:1,False:0})
    x_df.Dependents = x_df.Dependents.map({'0': 0, '1': 1, '2': 2, '3+': 3})
    x_df.Education = x_df.Education.map({'Graduate': 1, 'Not Graduate': 0})
    x_df.Self_Employed = x_df.Self_Employed.map({True: 1, False: 0})
    x_df.Property_Area = x_df.Property_Area.map(
        {'Urban': 2, 'Rural': 0, 'Semiurban': 1})
    x_df.drop('Loan_ID', axis= 1, inplace=True)

    Xt = x_df.iloc[1:542, 1:12]
    yt = x_df[['Loan_Status']]

    return Xt, yt


x, y = clean_data(ds)
# nan_x = np.isnan(x)
# not_nan_x = ~ nan_x
# x_final = x[not_nan_x]

In [20]:
x.head()

,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
2,1,0,1,1,3000,0.0,66.0,360.0,1.0,2,1.0
3,1,0,0,0,2583,2358.0,120.0,360.0,1.0,2,1.0
4,0,0,1,0,6000,0.0,141.0,360.0,1.0,2,1.0
5,1,2,1,1,5417,4196.0,267.0,360.0,1.0,2,1.0
6,1,0,0,0,2333,1516.0,95.0,360.0,1.0,2,1.0

In [14]:
x_df = ds.to_pandas_dataframe().dropna()

In [28]:
x_df.Married=x_df.Married.map({True:1,False:0})

In [21]:
x.head()

,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
2,1,0,1,1,3000,0.0,66.0,360.0,1.0,2,1.0
3,1,0,0,0,2583,2358.0,120.0,360.0,1.0,2,1.0
4,0,0,1,0,6000,0.0,141.0,360.0,1.0,2,1.0
5,1,2,1,1,5417,4196.0,267.0,360.0,1.0,2,1.0
6,1,0,0,0,2333,1516.0,95.0,360.0,1.0,2,1.0

In [25]:
xtra = x.iloc[0, :]

SyntaxError: invalid syntax (<ipython-input-25-9cf700c05e3b>, line 1)

In [26]:
xtra.to_json()

'{"Married":1.0,"Dependents":0.0,"Education":1.0,"Self_Employed":1.0,"ApplicantIncome":3000.0,"CoapplicantIncome":0.0,"LoanAmount":66.0,"Loan_Amount_Term":360.0,"Credit_History":1.0,"Property_Area":2.0,"Loan_Status":1.0}'

In [23]:
x_dff.head()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Loan_Status,Loan_ID_LP001003,Loan_ID_LP001005,Loan_ID_LP001006,Loan_ID_LP001008,...,Dependents_1,Dependents_2,Dependents_3+,Education_Graduate,Education_Not Graduate,Self_Employed_False,Self_Employed_True,Property_Area_Rural,Property_Area_Semiurban,Property_Area_Urban
1,4583,1508.0,128.0,360.0,1.0,False,1,0,0,0,...,1,0,0,1,0,1,0,1,0,0
2,3000,0.0,66.0,360.0,1.0,True,0,1,0,0,...,0,0,0,1,0,0,1,0,0,1
3,2583,2358.0,120.0,360.0,1.0,True,0,0,1,0,...,0,0,0,0,1,1,0,0,0,1
4,6000,0.0,141.0,360.0,1.0,True,0,0,0,1,...,0,0,0,1,0,1,0,0,0,1
5,5417,4196.0,267.0,360.0,1.0,True,0,0,0,0,...,0,1,0,1,0,0,1,0,0,1

In [4]:
x

array([[1, True, 0, ..., 360.0, 1.0, 2],
       [1, True, 0, ..., 360.0, 1.0, 2],
       [1, False, 0, ..., 360.0, 1.0, 2],
       ...,
       [1, True, 1, ..., 360.0, 1.0, 2],
       [1, True, 2, ..., 360.0, 1.0, 2],
       [0, False, 0, ..., 360.0, 0.0, 1]], dtype=object)